# Tägliche Übung - Pandas

Übe die must have skills in pandas:

                                    - "metadaten" abfragen
                                    - auf Werte zugreifen
                                    - bedingte abfragen
                                    - groupby(), agg()

In [1]:
# benötigte bib importieren

import pandas as pd 
import numpy as np 
import seaborn as sns

In [3]:
# datensatz laden - titanic datensatz, der in seaborn bib enthalten ist

df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# Spaltennamen und Datentypen in Erfahrung bringen
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [6]:
# lasse dir die ersten drei Zeilen anzeigen
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [7]:
# lasse dir die letzten 4 Zeilen anzeigen
df.tail(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
# lasse dir die spalten sex, age, fare, class und embark_town anzeigen
df.loc[:,['sex', 'age', 'fare', 'class','embark_town']]

        sex   age     fare   class  embark_town
0      male  22.0   7.2500   Third  Southampton
1    female  38.0  71.2833   First    Cherbourg
2    female  26.0   7.9250   Third  Southampton
3    female  35.0  53.1000   First  Southampton
4      male  35.0   8.0500   Third  Southampton
..      ...   ...      ...     ...          ...
886    male  27.0  13.0000  Second  Southampton
887  female  19.0  30.0000   First  Southampton
888  female   NaN  23.4500   Third  Southampton
889    male  26.0  30.0000   First    Cherbourg
890    male  32.0   7.7500   Third   Queenstown

[891 rows x 5 columns]

In [61]:
# wie viele klassen gab es auf der titanic?
df['class'].nunique()

3

In [12]:
# in der spalte class soll die 'First' class in 'exclusive' umbenannt werden   HINT: replace()
df['class'].replace('First','exclusive', inplace=True)
df['class']

/var/folders/63/b0j4zw4s4qsc9p9fz3s_r4nw0000gp/T/ipykernel_51353/3736869948.py:2: FutureWarning: The behavior of Series.replace (and DataFrame.replace) with CategoricalDtype is deprecated. In a future version, replace will only be used for cases that preserve the categories. To change the categories, use ser.cat.rename_categories instead.
  df['class'].replace('First','exclusive', inplace=True)

0          Third
1      exclusive
2          Third
3      exclusive
4          Third
         ...
886       Second
887    exclusive
888        Third
889    exclusive
890        Third
Name: class, Length: 891, dtype: category
Categories (3, object): ['exclusive', 'Second', 'Third']

In [13]:
# lasse dir diejenigen anzeigen die überlebt haben - 1 steht für überlebt, 0 steht für gestorben  
df.loc[df.survived == 1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,exclusive,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,exclusive,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,exclusive,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,exclusive,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,exclusive,man,True,C,Cherbourg,yes,True

In [14]:
# lasse dir die Frauen anzeigen die älter gleich 30 waren
df.loc[(df.sex=='female') & (df.age >= 30)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,exclusive,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,exclusive,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,exclusive,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
862,1,1,female,48.0,0,0,25.9292,S,exclusive,woman,False,D,Southampton,yes,True
865,1,2,female,42.0,0,0,13.0000,S,Second,woman,False,NaN,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,exclusive,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,exclusive,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False

In [62]:
# lasse dir das alter und den ticketpreis anzeigen von den männern an board die über 60 sind und in der exclusive class waren
df.loc[
    (df['sex'] =='male') & 
    (df['age'] > 60)&
    (df['class'] == 'exclusive'),
    ['age', 'fare']
]

      age      fare
54   65.0   61.9792
96   71.0   34.6542
170  61.0   33.5000
252  62.0   26.5500
438  64.0  263.0000
456  65.0   26.5500
493  71.0   49.5042
545  64.0   26.0000
555  62.0   26.5500
625  61.0   32.3208
630  80.0   30.0000
745  70.0   71.0000

In [47]:
# wie viele Männer und Frauen waren auf der titanic? HINT: groupby() agg()
df.groupby('sex').size()

sex
female    314
male      577
dtype: int64

In [63]:
df.groupby('sex').agg({'sex':'count'})

        sex
sex
female  314
male    577

In [67]:
# wie viele der Frauen/Männer haben überlebt/ sind gestorben?  HINT: groupby() agg()
df.groupby(['sex', 'survived'], observed=False).agg({'survived':np.size})

                 survived
sex    survived
female 0               81
       1              233
male   0              468
       1              109

In [64]:
df.groupby(['sex']).agg(
    Überlebensrate=('survived', 'sum'),
    gest=('survived', lambda x: (x==0).sum())
)

        Überlebensrate  gest
sex
female             233    81
male               109   468

In [68]:
# bezogen auf den film titanic: musste Jack sterben, weil er aus der 3.klasse kam und hat Cate überlebt, weil sie aus der 1.ten klasse kam?    HINT: groupby() agg()
df.groupby(['class', 'sex']).agg(
    Überlebensrate=('survived', 'mean'),
    Anzahl_Personen=('survived', 'count'),
    gest=('survived', lambda x: (x==0).sum())
)

/var/folders/63/b0j4zw4s4qsc9p9fz3s_r4nw0000gp/T/ipykernel_51353/3322606347.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['class', 'sex']).agg(

                  Überlebensrate  Anzahl_Personen  gest
class     sex
exclusive female        0.968085               94     3
          male          0.368852              122    77
Second    female        0.921053               76     6
          male          0.157407              108    91
Third     female        0.500000              144    72
          male          0.135447              347   300